Домашняя_работа/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ЕмайлКонтрагента</name>
      <description>Емайл контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Домашняя_работа/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>Емайл</name>
  </enumValues>
  <enumValues>
    <name>Вебсайт</name>
  </enumValues>
</mdclass:Enum>

Домашняя_работа/src/Catalogs/ВидыКонтактнойИнформации/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ЕмайлКонтрагента.ПолучитьОбъект();
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Емайл;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента.ПолучитьОбъект();
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.Записать();
	
	АдресТип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
КонецПроцедуры
